Catalogs/СпецификацииКДоговорам/СпецификацииКДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпецификацииКДоговорам</name>
  <owners>Catalog.ДоговорыКонтрагентов</owners>
  <attributes>
    <name>Лео_ЧислоДнейПредоплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеЧислоДнейЗадолженности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ПроцентПредоплатыПоставщик</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Catalogs/СпецификацииКДоговорам/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.  
	Перем ДоговорКонтрагента;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	ДоговорКонтрагента = Владелец;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Владелец") Тогда
		ДоговорКонтрагента = ДанныеЗаполнения.Владелец;
	КонецЕсли; 
	
	Если ЭтоНовый() Тогда 
		Владелец						=	ДоговорКонтрагента;
		Лео_ЧислоДнейПредоплаты			=	Владелец.Лео_ЧислоДнейПредоплаты;
		ДопустимоеЧислоДнейЗадолженности=	Владелец.ДопустимоеЧислоДнейЗадолженности;
		Лео_ПроцентПредоплатыПоставщик	=	Владелец.Лео_ПроцентПредоплатыПоставщик;	
	КонецЕсли;
КонецПроцедуры
